🚀&nbsp; env0 had composed a PR Plan for environment [Terraform Example / production ](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50):
```
Plan: 2 to add, 2 to change, 2 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # module.scenarios[0].aws_instance.app_server must be replaced
-/+ resource "aws_instance" "app_server" {
!       ami                                  = (sensitive value) # forces replacement
!       arn                                  = "arn:aws:ec2:eu-west-2:540044833068:instance/i-040ea0e5ae41e15b5" -> (known after apply)
!       availability_zone                    = "eu-west-2b" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
+       enable_primary_ipv6                  = (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
!       id                                   = "i-040ea0e5ae41e15b5" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
!       monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-01dc521890e190349" -> (known after apply)
!       private_dns                          = "ip-10-0-10-197.eu-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.10.197" -> (known after apply)
!       public_dns                           = "ec2-3-8-147-206.eu-west-2.compute.amazonaws.com" -> (known after apply)
!       public_ip                            = "3.8.147.206" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
+       spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "App Server"
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 2 -> null
        }

-       credit_specification {
-           cpu_credits = "unlimited" -> null
        }

-       enclave_options {
-           enabled = false -> null
        }

-       maintenance_options {
-           auto_recovery = "default" -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_protocol_ipv6          = "disabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
-           instance_metadata_tags      = "disabled" -> null
        }

-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = false -> null
-           enable_resource_name_dns_aaaa_record = false -> null
-           hostname_type                        = "ip-name" -> null
        }

!       root_block_device {
!           device_name           = "/dev/xvda" -> (known after apply)
!           encrypted             = false -> (known after apply)
!           iops                  = 100 -> (known after apply)
+           kms_key_id            = (known after apply)
-           tags                  = {} -> null
!           tags_all              = {} -> (known after apply)
!           throughput            = 0 -> (known after apply)
!           volume_id             = "vol-05775cc18e1771be5" -> (known after apply)
!           volume_size           = 8 -> (known after apply)
!           volume_type           = "gp2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.scenarios[0].aws_instance.webserver must be replaced
-/+ resource "aws_instance" "webserver" {
!       ami                                  = (sensitive value) # forces replacement
!       arn                                  = "arn:aws:ec2:eu-west-2:540044833068:instance/i-04899e75bb8fe2e54" -> (known after apply)
!       availability_zone                    = "eu-west-2a" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
+       enable_primary_ipv6                  = (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
!       id                                   = "i-04899e75bb8fe2e54" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
!       monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-02d5855d872c9a526" -> (known after apply)
!       private_dns                          = "ip-10-0-9-192.eu-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.9.192" -> (known after apply)
!       public_dns                           = "ec2-18-130-249-134.eu-west-2.compute.amazonaws.com" -> (known after apply)
!       public_ip                            = "18.130.249.134" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
+       spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "Webserver"
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 2 -> null
        }

-       credit_specification {
-           cpu_credits = "unlimited" -> null
        }

-       enclave_options {
-           enabled = false -> null
        }

-       maintenance_options {
-           auto_recovery = "default" -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_protocol_ipv6          = "disabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
-           instance_metadata_tags      = "disabled" -> null
        }

-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = false -> null
-           enable_resource_name_dns_aaaa_record = false -> null
-           hostname_type                        = "ip-name" -> null
        }

!       root_block_device {
!           device_name           = "/dev/xvda" -> (known after apply)
!           encrypted             = false -> (known after apply)
!           iops                  = 100 -> (known after apply)
+           kms_key_id            = (known after apply)
-           tags                  = {} -> null
!           tags_all              = {} -> (known after apply)
!           throughput            = 0 -> (known after apply)
!           volume_id             = "vol-07813f7162305d616" -> (known after apply)
!           volume_size           = 8 -> (known after apply)
!           volume_type           = "gp2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.scenarios[0].aws_launch_template.my_launch_template will be updated in-place
!   resource "aws_launch_template" "my_launch_template" {
        id                      = "lt-04dc7394984712fe8"
!       image_id                = "ami-0a54f89b831444829" -> "ami-012cce9e78c650beb"
!       latest_version          = 1 -> (known after apply)
        name                    = "asg-change-launch-template-terraform-example2025111723203932490000000b"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }


  # module.scenarios[0].aws_rds_cluster.face_database will be updated in-place
!   resource "aws_rds_cluster" "face_database" {
        id                                    = "facial-recognition-terraform-example"
        tags                                  = {}
        # (46 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2/deployments/eef6a0db-fdb0-4c2f-8676-7b1675ff049e?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50)

[Get instant insights with AI Summary](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2/deployments/eef6a0db-fdb0-4c2f-8676-7b1675ff049e?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50&ai-analyzer=plan-summary)